# Chi-Square Test by `Mr. Harshit Dawar!`
* This test is used to compare the expected value to the observed value, & decide whether to accept or reject the Null Hypothesis or in simple words, whether to select a feature or not!


* It is a Statistical Test.


* It can be used in the case of Categorical Variables/Features Only, it cannot be used with continuous features.


* If the calculated values is more than the Tabular/Critical Value, then the Null Hypothesis is rejected.


* The less the p - value is for a particular feature, the more the significance of that particular feature.


* Chi Square is also known as Fisher Score.

In [1]:
# Importing the Libraries

import pandas as pd
import numpy as np
from sklearn.feature_selection import chi2, SelectKBest

In [21]:
# Loading the Dataset

data = pd.read_csv("../ds/Titanic_Dataset.csv")

In [22]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [23]:
data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

***As it can be clearly observed that, only 3 features that are ["Cabin", "Sex", "Embarked"] categorical & can be used to predict the target variable i.e. Survived or not, so, let's begin with them only!***

In [24]:
# Encoding the Categorical Variables
ordinal_label = {value: index for index, value in enumerate(data['Embarked'].unique())}

In [25]:
ordinal_label

{'S': 0, 'C': 1, 'Q': 2, nan: 3}

In [26]:
data.Embarked = data.Embarked.map(ordinal_label)

In [33]:
data.Cabin.fillna("Missing", inplace = True)
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,Missing,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,Missing,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,Missing,0

In [34]:
def processCabin(category):
    return category[:1]

data["Cabin"] = data["Cabin"].map(processCabin)

In [36]:
ordinal_label = {value: index for index, value in enumerate(data['Cabin'].unique())}
data.Cabin = data.Cabin.map(ordinal_label)

In [37]:
data.Cabin.unique()

array([0, 1, 2, 3, 4, 5, 6, 7, 8])

In [39]:
data.Sex = np.where(data.Sex == "male", 1, 0)

In [40]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,0,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,1,1
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,0,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,1,0
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,0,0